
> (define size 2)
size

> size
2
> (* 5 size)
10

> (define pi 3.14159)
pi
> (define radius 10)
radius
> (* pi (* radius radius))
314.159
> (define circumference (* 2 pi radius))
circumference
> circumference
62.8318
