> (define (abs x)
.         (cond ((> x 0) x)
.               ((= x 0) 0)
.               ((< x 0) (- x))))
abs


> (abs 3)
3

> (abs -4)
4

> (define (abs x)
.         (if (< x 0)
.             (- x)
.             x))
abs

> (abs 3)
3

> (abs -4)
4
