> (define (factorial n)
.         (if (= n 1)
.             1
.             (* n (factorial (- n 1)))))
factorial

> (factorial 6)
720


> (define (fact-iter product counter max-count)
.         (if (> counter max-count)
.             product
.             (fact-iter (* counter product)
.                        (+ counter 1)
.                        max-count)))
fact-iter

> (define (factorial n)
.         (fact-iter 1 1 n))
factorial

> (factorial 6)
720



